Revit 2027 API
SketchPlane.GetPlane Method
 Returns the corresponding Plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Plane GetPlane()
Public Function GetPlane As Plane
public:
Plane^ GetPlane()
member GetPlane : unit -> Plane
Return Value
Plane
 The plane upon which elements created with this sketch plane will lie.
See Also
Reference
SketchPlane Class
Autodesk.Revit.DB Namespace